{"commands":[{"command":["mrmine","mrmime"],"count":0,"response":"Mr.Mime, he does nothing"},{"command":["miners"],"count":0,"response":"Miners increase mining speed by 10% each.\\nUpgrades increase mining speed by 10% each.\\nMiners find chests for you, the deeper you go the more chances of chests."},{"command":["city"],"count":0,"response":"||The Underground City|| is located at ||303Km|| and is where you upgrade weapons, drill for oil and complete the 2nd lot of quests."},{"command":["monsters"],"count":0,"response":"Monsters start attacking your miners from ||304Km||, you use weapons to fight them.\\nThe background flashes red when a monster attack is happening."},{"command":["golem"],"count":0,"response":"The Golem can be found at ||50Km||, he ||lives in a cave to the left|| and sells blueprints."},{"command":["112"],"count":0,"response":"That's Mr.Mime.\\nHe's a joke prop.\\nA lot people were getting the name wrong with the browser version."},{"command":["роль"],"count":0,"response":"Для того, что бы получить роль нужно: \\n1. Зайти в игру и нажать настройки (правый верхний угол). В открывшемся окне кликнуть Export Game \\n2. Откроется код вашего экспорта и кнопка копирования. Нажмите на неё. \\n3. Далее нужно на сервере игры в дискорде написать личное сообщение <@!764713414206423061> (его можно найти в списке участников сервера справа) отправив ему скопированный текст из п.2 \\n4. Если размер экспорта превышает 2000 символов - он будет загружаться в текстовом документе. Просто нажмите кнопку Загрузить"},{"command":["scientists"],"count":0,"response":"Scientists are sent to go on excavations with varying difficulties. Each excavation has a death chance. There are factors that can change this. The rarity of scientists can effect the death chance as well how often a rare item shows up. Level can also play a factor of how often a rare item shows up. There are currently 4 rarities of scientists. Here's how each of the rarities effects the death chance for a excavation:\\n\\nCommon: No Death Chance reduction.\\nUncommon: Lowers Death Chance by 10%.\\nRare: Lowers Death Chance by 25%.\\nLegendary: Lowers Death Chance by 50%."},{"command":["bosses"],"count":0,"response":"Bosses are always ||100km|| apart ( with an exception of ||1000km|| ), starting at ||400km|| with the first boss.\\nThe bosses on the ||moon|| are just shifted a little bit and are starting at ||1132km|| and then the next one continuing after ||100km||.\\nWhen you arrive at a km with a boss, your drill will stop digging any more km, until you defeat the boss.\\nIf you lose the fight, nothing will happen and the boss will just be there, until you finally beat him.\\nIf you cannot defeat the boss, try getting/upgrading some weapons or get some combat relics."},{"command":["relics"],"count":0,"response":"Relics are gained through scientist missions.\\nRelics are always activated.\\nRelics effects stack except for the ones that grant consumables, resources, timelapses and relic bags.\\nAll missions have a DC (Death Chance) percentage, the higher the more chance of losing your scientist."},{"command":["codes"],"count":0,"response":"The devs create the codes.\\nThe codes are given out randomly.\\nPlease do not ask for any codes.\\nNEVER ask the devs for any codes.\\nLook in <#764279333262852138> for codes.\\nThe codes expire after a certain amount of time."},{"command":["chests"],"count":0,"response":"Chests are found by miners.\\nThe deeper you go the more miners you have & the more chances of a chest being found.\\nChests even spawn while at full capacity.\\nGold chests are the rarest and have a 1/158 drop chance.\\nThey contain the best rewards but it could take a long time to get what you want from them.\\nChests have timers so it's best to check every 5-10 minutes for them before they expire as you wouldn't want to miss a gold one."},{"command":["quests"],"count":0,"response":"The first 15 quests are at the old guy above the drill center.\\nThe next 15 quests are in the ||Underground city||, the middle top building."},{"command":["role"],"count":0,"response":"Just go into the in game settings click export and DM <@!764713414206423061> with that code and you should automatically get a role. It's okay if the message is over 2000 characters and gets turned in to a txt file, it can still read it. For further explanations go and read <#808451078201802812>. The roles don’t update by themselves, so you will have to do it again, every time you reach the next role requirements."},{"command":["rank"],"count":0,"response":"Just go into the in game settings click export and DM <@!764713414206423061> with that code and you should automatically get a role. It's okay if the message is over 2000 characters and gets turned in to a txt file, it can still read it. For further explanations go and read <#808451078201802812>. The roles don’t update by themselves, so you will have to do it again, every time you reach the next role requirements."},{"command":["core-ru"],"count":0,"response":"Механика книги секретов и приношения в жертву в ядре:\\n||Активация ядра через 1 книгу секретов - ядро становится синим. \\nДалее нужно кинуть в ядро реликвию и получить её улучшенный вариант. \\nВАЖНО! шанс не 100%, реликвия может испариться, но ядро останется активным. \\nВторой вариант - Две книги секретов. После активации ядра кидаем вторую книгу секретов и получаем книгу секретов+. \\nАктивация книги секретов+ окрашивает ядро в белый. \\nТакое ядро производит реликвию++. \\nПримечание: Активация ядра - 1 раз. Для повторной активации нужна новая книга секретов. \\nАктивация двух книг секретов+ даст книгу секретов++ (увеличение шанса успех до 50% трансформации реликвии). \\nКнигой секретов нельзя второй раз улучшить реликвию+.||"},{"command":["112-ru"],"count":0,"response":"Это Mr. Mime. Он ничего не далает.\\nЭто отсылка к созвучному названию игры. Mr.Mime, как Mr.Mine\\nВ старой браузерной версии очень часто путали название."},{"command":["112-de"],"count":0,"response":"Das ist Mr.Mime. Er ist eine Witz Requesite\\n\nViele Leute haben den Namen falsch verstanden."},{"command":["weapons"],"count":0,"response":"Weapons can be obtained after you reach the Underground City at 304km. There are 12 weapons in total. You first start out with a fist. The rest of the weapons can be acquired in the following ways:\\n\\nA lot of the weapons like Rock, Sword or Big Bomb could be dropped from normal chests.\\nPickaxes, Mallet, Bow and Arrow could also be acquired by killing monsters.\\nHeal and Time Travel could be aquired by opening Golden Chests.\\nHowever all weapons can also be recieved from the scientist mission - Unlock New Weapon.\\n\\nThe Heal and Time Travel weapons have special effects. The heal weapon heals you for a small amount HP and Time Travel allows all your cooldowns for your weapons to jump forward by a little bit.\\n\\nEach weapon does its own amount of damage and has its own cooldown timer at which it fills up. Both of which can be improved by upgrading your weapons. These will require various amounts of different gems and oil. To upgrade your weapon and to see their statistics, click the right most building ( the statue of a knight ) in the Underground City"},{"command":["blueprints"],"count":0,"response":"Blueprints are what you use to craft parts for your drill. There are 4 parts in total: Drill, Engine, Cargo and Cooler. Currently there are 29 levels of blueprints, with the exception of Cargo which ends at 14.\\n\\nBlueprint Lvl's 1-5 can be found at the Drill Center on Earth.\\n\\nBlueprint Lvl's 6-9 can be found after you've acquired the Golem at 50km.\\n\\nBlueprint Lvl's 10-13 can be found after you've acquired the Broken Robot at 225km.\\n\\nBlueprint Lvl's 14-17 can be found either through Golden Chests or trading through the Trader.\\n\\nBlueprint Lvl's 18-20 can be crafted or found through the Trader after you've reached the Moon at 1032km.\\n\\nBlueprint Lvl's 21-23  can be acquired through the Trader or found in Golden Chests.\\n\\nBlueprint Lvl's 24-26 can be found after you've reached the Robot MK2 located at 1257km (W2-225km). They can also be found through trading at the Trader.\\n\\nBlueprint Lvl's 27-29 can be found through Golden Chests or trading through the Trader."},{"command":["milestones"],"count":0,"response":"Here are all the buildings/shops in the game:\\n\\n20km - ||trading post - once every +-5 hours there will be a trader there||\\n50km - ||golem - shop for blueprints ( lvl 6-9 )||\\n225km - ||broken robot - another shop for blueprints ( lvl 10-13 )||\\n300-303km - ||underground city:\\n - right building - forge\\n - left building - weapon upgrades and stats\\n - middle down building - upgrades and capacity for oil pump\\n - middle up building - next set of quests||\\n501km - ||the core - place for sacrificing materials/relics for other materials/relics||\\n1032km - ||the moon - the exact same buildings as the ones at 0km ( without scientists and quests )||\\n1052km ( W2 - 20km ) - ||another trading post - same as the first one||\\n1257km ( W2 - 225km ) - ||Robot MK2 - another shop for blueprints ( lvl 24-26 )||\\n1333-1334km ( W2 - 301-302km ) - ||the reactor - the place for generating energy for the lab||\\n1335km ( W2 - 303km ) - ||the lab - a place to buy some buffs for the energy from the reactor||"},{"command":["core"],"count":0,"response":"There are two types of sacrificing, material and relic sacrificing:\\n\\nMaterial Sacrificing:\\nThrowing in any earth materials will either give you “nothing happens” or around the same value of another earth material, value can be slightly higher or lower to add some variance.\\n\\nRelic Sacrificing:\\nThrowing in any relic will either give you “nothing happens” or sometimes it can give you another relic back. The relics returned are based on what is thrown in for example endless miner speed potions can give you back endless drill speed potions, endless scientist speed potions, endless gem speed potions and a few others."},{"command":["commands"],"count":0,"response":"To input a command put !(command). Some of these commands will be edited in the future. You can either sent these commands to <@!764713414206423061> in DMs or just type them out in this discord channel. Here are all the useful commands to help you with the game:\\n112\\nblueprints\\nbosses\\nchests\\ncity\\ncore\\nforge\\ngolem\\nmanager\\nmetal/metaldetector\\nmilestones\\nmonsters\\nmrmine\\noilrig\\nquests\\nrelics\\nrole/rank\\nscientists\\nsecrets\\nweapons\\nwiki"},{"command":["metaldetector"],"count":0,"response":"Currently there are 5 levels of Metal Detector. You can get all the levels from a normal or a golden chest. Each having their own varying effects. The effects of each are as follows:\\n\\nLevel 1: An object near the left of the Sell Center will appear. It will flash on and off whenever a chest appears.\\n\\nLevel 2: Your Metal Detector will now detect Golden Chests and locations of where normal chests are at. Brownish dots will appear on the scrollbar indicating where each chest is at. Also monster locations will appear with a red dot (Only valid in the underground at 304+ km).\\n\\nLevel 3 Golden Chests will appear on your scrollbar as a gold dot. A message will also appearing saying the location of the chest and how long the chest will stay spawned for.\\n\\nLevel 4: Will show you where mineral deposits are. This is indicated by a blue line on your scrollbar. All you have to do is click on them multiple times to collect them. And with this level, you can use a hotkey - spacebar , to jump to the nearest chest from the top of the mine to the bottom.\\n\\nLevel 5: Will let you know when a chest is about to expire. The chest dot will flicker on your scrollbar when it is about to expire."},{"command":["forge"],"count":0,"response":"The forge is located at depth 303Km in the Underground City. The forge is used to craft various gems. Gems are required upgrade weapons.\\n\\nForge levels, workloads & costs:\\nLvl 1: Workload 6, upgrade costs $1T + 16 oil ->\\nLvl 2: Workload 8, upgrade costs $4T + 200 oil ->\\nLvl 3: Workload 12, upgrade costs $50T + 2000 oil ->\\nLvl 4: Workload 20, upgrade costs $500T + 4500 oil ->\\nLvl 5: Workload 25, upgrade costs $6q + 6000 oil ->\\nLvl 6: Workload 30 upgrade costs $100q + 8000 oil ->\\nLvl 7: Workload 35, upgrade costs $1Q + 11000 oil ->\\nLvl 8: Workload 40, upgrade costs $50Q + 15000 oil ->\\nLvl 9: Workload 45, upgrade costs $1 Sextillion + 20000 oil ->\\nLvl 10: Workload 50"},{"command":["oilrig"],"count":0,"response":"The oil rig is located at 303km in the Underground City.\\nOil Rig are used for:\\n\\nBlueprints\\nGems for Upgrading Weapons\\nCrafting for Reactor on the Moon\\n\\nOil Rig levels, capacity and costs:\\n\\nLvl 0 to Lvl 1: Cap 2, upgrade costs 5 Building Materials and $100 Billion\\nLvl 1 to Lvl 2: Cap 4, upgrade costs 7 Building Materials and $250 Billion\\nLvl 2 to Lvl 3: Cap 16, upgrade costs 10 Building Materials and $500 Billion\\nLvl 3 to Lvl 4: Cap 32, upgrade costs 20 Building Materials and $1 Trillion\\nLvl 4 to Lvl 5: Cap 100, upgrade costs 30 Building Materials and $2 Trillion\\nLvl 5 to Lvl 6: Cap 200, upgrade costs 50 Building Materials and $3 Trillion\\nLvl 6 to Lvl 7: Cap 400, upgrade costs 60 Building Materials and $5 Trillion\\nLvl 7 to Lvl 8: Cap 1000, upgrade costs 70 Building Materials and $10 Trillion\\nLvl 8 to Lvl 9: Cap 2000, upgrade costs 80 Building Materials and $50 Trillion\\nLvl 9 to Lvl 10: Cap 4000, upgrade costs 90 Building Materials and $100 Trillion\\nLvl 10 to Lvl 11: Cap 8000, upgrade costs 100 Building Materials and $500 Trillion\\nLvl 11 to Lvl 12: Cap 12000, upgrade costs 150 Building Materials and $3 Quadrillion\\nLvl 12 to Lvl 13: Cap 16000, upgrade costs 250 Building Materials and $50 Quadrillion\\nLvl 13 to Lvl 14: Cap 20000, upgrade costs 500 Building Materials and $500 Quadrillion\\nLvl 14 to Lvl 15: Cap 25000, upgrade costs 1500 Building Materials and $20 Quintillion\\nLvl 15 to Lvl 16: Cap 30000, upgrade costs 5000 Building Materials and $600 Quintillion"},{"command":["secrets"],"count":0,"response":"Relics may be upgraded for higher bonuses at The Core by sacrificing a Book of Secrets.||\\nWhen a Book of Secrets is sacrificed, it is consumed and The Core will turn blue (corrupted).\\nThe corrupted Core has a chance to upgrade a sacrificed relic to Warped rarity and add + to the end of its name.\\nA Book of Secrets may be upgraded in this way with a 100% success chance, and can be sacrificed to turn The Core white (blessed).\\nThe blessed Core has a chance to upgrade a sacrificed relic **except** for a Book of Secrets to Divine rarity and add ++ to the end of its name. Sacrificing a Book of Secrets will instead revert The Core to its corrupted state.\\nExcept for the Book of Secrets, all relics have a chance to fail to upgrade, which will destroy the relic, but The Core will remain in its current state.\\nOnly a successful relic upgrade will return The Core to its standard state.\\nNote: While The Core is corrupted or blessed, normal relic sacrifices cannot be performed. The Core's state has no effect on mineral sacrifices.||"},{"command":["metal"],"count":0,"response":"The Metal Detector is a structure that can be crafted in the Craft Center. Currently, there are 5 levels. The effects of each are as follows:\\n\\nLevel 1: An object near the left of the Sell Center will appear. It will blink a red light whenever a chest is present in the mine.\\n\\nLevel 2: Chests are now marked on the scroll bar as brown dots. Gold Chests will also display a message at the top of the screen when they appear. In addition, monster locations will be marked as a red dot on the scroll bar (Only valid in the underground at 304+ km).\\n\\nLevel 3: Gold Chests are now marked on the scroll bar as yellow dots. Additional messages will also appear telling the depth of the chest and how long it will remain spawned for.\\n\\nLevel 4: Mineral deposits are now marked on the scroll bar as blue lines. Additionally, the spacebar may now be used to jump to spawned chests, mineral deposits, and monsters, in that order.\\n\\nLevel 5: Chests and mineral deposits that are close to expiring will now blink on the scroll bar. In addition, Orange Fish are now marked on the scroll bar with a blue line."},{"command":["wiki"],"count":0,"response":"Go to https://mrmine.fandom.com/wiki/Mr._Mine_Wiki. It is updated frequently, check it out if you need more detailed information about the game. "},{"command":["manager"],"count":0,"response":"Currently there are 3 levels of managers. All 3 levels of manager can be crafted in the Top Level section of the crafting tab. The effects for each level are as follows:\\n\\nManager Lv 1: Unlocks the Lock function where you can set ores to be sold until amount. Also allows for Offline Progression, where you'll receive 25% or your normal progress for 12 hours.\\nManager Lv2: Grants a small increase of finding rarer materials (excluding the isotopes). Increases the effect Offline Progression, where you'll receive 50% of your normal progress for 24 hours.\\nManager Lv3: Grants a small increase to find normal chests. Increases the effect of Offline Progression, where you'll receive 100% of your normal progress for 48 hours.\\n\\nNote: During Offline Progression it will only count towards your depth and the ores/isotopes that are mined. Only chests that go to Chest Collector are counted and also no fights from monsters will be included in offline progression."}]}